# Pandas Example

Library that helps you interact with row and column type data

# Object Creation

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creates a Series by passing a list of values, letting pandas create a default integer index

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Creates datatime index and returns date range

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.835980  0.094626 -0.787771  0.167861
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079
2013-01-05  0.245426  0.175320  0.138328  0.355349
2013-01-06 -0.651215 -0.962571  1.324725 -1.210539

Creates a DataFrame by passing a NumPy array
* applies datetime index label and and lettered columns labels

In [5]:
 df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})
   ...: 

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Creates a DataFrame by passing a dict of objects that can be converted to series-like

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

The columns of the resulting DataFrame have different dtypes

# Viewing Data

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -0.835980  0.094626 -0.787771  0.167861
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079
2013-01-05  0.245426  0.175320  0.138328  0.355349

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079
2013-01-05  0.245426  0.175320  0.138328  0.355349
2013-01-06 -0.651215 -0.962571  1.324725 -1.210539

Here is how to view the top and bottom rows of the frame

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Display index

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

Display columns

In [11]:
df.to_numpy()

array([[-0.8359798 ,  0.09462619, -0.78777105,  0.16786052],
       [ 0.03304721, -0.92948125, -0.3059671 ,  0.07493025],
       [ 0.22474721,  0.99921732,  0.03432648,  0.67030857],
       [-2.1111282 , -0.56797371,  1.319383  , -0.03707881],
       [ 0.24542621,  0.17532019,  0.13832765,  0.35534857],
       [-0.65121464, -0.96257094,  1.32472489, -1.21053909]])

Dataframe to numpy with single data types

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

Dataframe to numpy for multuple data types (different per column) is relatively expensive

*Note:
DataFrame.to_numpy() does not include the index or column labels in the output.

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.515850 -0.198477  0.287171  0.003472
std    0.904990  0.763523  0.864335  0.644373
min   -2.111128 -0.962571 -0.787771 -1.210539
25%   -0.789789 -0.839104 -0.220894 -0.009077
50%   -0.309084 -0.236674  0.086327  0.121395
75%    0.176822  0.155147  1.024119  0.308477
max    0.245426  0.999217  1.324725  0.670309

Shows quick statistic summary

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.835980    0.033047    0.224747   -2.111128    0.245426   -0.651215
B    0.094626   -0.929481    0.999217   -0.567974    0.175320   -0.962571
C   -0.787771   -0.305967    0.034326    1.319383    0.138328    1.324725
D    0.167861    0.074930    0.670309   -0.037079    0.355349   -1.210539

Transposes data

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.167861 -0.787771  0.094626 -0.835980
2013-01-02  0.074930 -0.305967 -0.929481  0.033047
2013-01-03  0.670309  0.034326  0.999217  0.224747
2013-01-04 -0.037079  1.319383 -0.567974 -2.111128
2013-01-05  0.355349  0.138328  0.175320  0.245426
2013-01-06 -1.210539  1.324725 -0.962571 -0.651215

Sorts by axis

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.651215 -0.962571  1.324725 -1.210539
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079
2013-01-01 -0.835980  0.094626 -0.787771  0.167861
2013-01-05  0.245426  0.175320  0.138328  0.355349
2013-01-03  0.224747  0.999217  0.034326  0.670309

Sorts by values

# Selection

Selection uses [] because calls fields not function

## Getting

In [17]:
df['A']

2013-01-01   -0.835980
2013-01-02    0.033047
2013-01-03    0.224747
2013-01-04   -2.111128
2013-01-05    0.245426
2013-01-06   -0.651215
Freq: D, Name: A, dtype: float64

Selects single column --> series

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.835980  0.094626 -0.787771  0.167861
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309

Selects slice of row

## Selection by Label

In [19]:
df.loc[dates[0]]

A   -0.835980
B    0.094626
C   -0.787771
D    0.167861
Name: 2013-01-01 00:00:00, dtype: float64

Selects cross section using a label: returns row selected by row index as series with fliped axis

In [20]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.835980  0.094626
2013-01-02  0.033047 -0.929481
2013-01-03  0.224747  0.999217
2013-01-04 -2.111128 -0.567974
2013-01-05  0.245426  0.175320
2013-01-06 -0.651215 -0.962571

Selecting on a multi-axis by label

In [21]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.033047 -0.929481
2013-01-03  0.224747  0.999217
2013-01-04 -2.111128 -0.567974

Showing label slicing, both endpoints are included

In [22]:
df.loc['20130102', ['A', 'B']]

A    0.033047
B   -0.929481
Name: 2013-01-02 00:00:00, dtype: float64

Reduction in the dimensions of the returned object: returns row selected as series with fliped axis when only 1 row

In [23]:
df.loc[dates[0], 'A']
df.at[dates[0], 'A']

-0.8359798025737335

Two ways to get scalar value using label
* second is fast acting

## Selection by Position

* index for labels and integer starts at 0

In [24]:
 df.iloc[3]

A   -2.111128
B   -0.567974
C    1.319383
D   -0.037079
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
 df.iloc[3:4]

                   A         B         C         D
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079

In [26]:
 df.iloc[3:5]

                   A         B         C         D
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079
2013-01-05  0.245426  0.175320  0.138328  0.355349

Selects row by integer postion: returns row selected as series with fliped axis when only 1 row
* notice [3:4] is actually [3, 4) mathimatically because it only shows 3 and doesn't convert it to series
* can't mix label and integer selection for rows and columns
* 3 and 3:4 have same values by 3 is arrange as series and 3:4 as df

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -2.111128 -0.567974
2013-01-05  0.245426  0.175320

Selects row slice by integer position

In [28]:
df.iloc[[3, 4], [0, 2]]

                   A         C
2013-01-04 -2.111128  1.319383
2013-01-05  0.245426  0.138328

Selects row slice by list of integers positions
* notice [3, 4] === 3:5

In [29]:
df.iloc[[3, 4], 0:2]

                   A         B
2013-01-04 -2.111128 -0.567974
2013-01-05  0.245426  0.175320

Can use swap list and non list for above but wont be same unless list is make concurrent i.e. [1,2,3] not [1, 3]

In [30]:
df.iloc[[1, 2], :]

                   A         B         C         D
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309

In [31]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309

Slicing rows explicity (with all columns)
* can use list or non list of integer positions

In [32]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.094626 -0.787771
2013-01-02 -0.929481 -0.305967
2013-01-03  0.999217  0.034326
2013-01-04 -0.567974  1.319383
2013-01-05  0.175320  0.138328
2013-01-06 -0.962571  1.324725

In [33]:
df.iloc[:, [1, 2]]

                   B         C
2013-01-01  0.094626 -0.787771
2013-01-02 -0.929481 -0.305967
2013-01-03  0.999217  0.034326
2013-01-04 -0.567974  1.319383
2013-01-05  0.175320  0.138328
2013-01-06 -0.962571  1.324725

Slicing columns explicity (with all rows)

* can use list or non list of integer positions

In [34]:
df.iloc[1, 2]

-0.3059670956146154

Gets value explicitly using integer position
* using list i.e. df.iat[[1], [1]] will yield df of value with row and column labels

In [35]:
df.iat[1, 1]

-0.9294812477162101

Fast acting was to get scalar using integer postion 
* does same thig as label mehtod

## Boolean Indexing

In [36]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-02  0.033047 -0.929481 -0.305967  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309
2013-01-05  0.245426  0.175320  0.138328  0.355349

Uses single column to selects data that meets boolean condition
* returns all rows where value of 'A' row is positive
* notice: uses label

In [37]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.094626       NaN  0.167861
2013-01-02  0.033047       NaN       NaN  0.074930
2013-01-03  0.224747  0.999217  0.034326  0.670309
2013-01-04       NaN       NaN  1.319383       NaN
2013-01-05  0.245426  0.175320  0.138328  0.355349
2013-01-06       NaN       NaN  1.324725       NaN

Selects all values to select data that meet boolean condition
* returns df with all positive values and NaN for non positive

In [38]:
df2 = df.copy()
df2['A'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                A         B         C         D
2013-01-01    one  0.094626 -0.787771  0.167861
2013-01-02    one -0.929481 -0.305967  0.074930
2013-01-03    two  0.999217  0.034326  0.670309
2013-01-04  three -0.567974  1.319383 -0.037079
2013-01-05   four  0.175320  0.138328  0.355349
2013-01-06  three -0.962571  1.324725 -1.210539

In [39]:
#df2[df2['E'].isin(['two', 'four'])]

Copyies df, adds column and uses isin() for filtering
* uses label
* list added must have same length as df (df length = rows)

## Setting

In [40]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.835980  0.094626 -0.787771  0.167861  NaN
2013-01-02  0.033047 -0.929481 -0.305967  0.074930  1.0
2013-01-03  0.224747  0.999217  0.034326  0.670309  2.0
2013-01-04 -2.111128 -0.567974  1.319383 -0.037079  3.0
2013-01-05  0.245426  0.175320  0.138328  0.355349  4.0
2013-01-06 -0.651215 -0.962571  1.324725 -1.210539  5.0

Sets series as new column by aligning data by same index (dates)

In [42]:
df.at[dates[0], 'A'] = 0
df.iloc[[0], [0]] ## used to show change without whole table

              A
2013-01-01  0.0

Sets value by label

In [43]:
df.iat[0, 1] = 0
df.iloc[[0], [1]]

              B
2013-01-01  0.0

Sets value by integer position

In [44]:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.787771  5  NaN
2013-01-02  0.033047 -0.929481 -0.305967  5  1.0
2013-01-03  0.224747  0.999217  0.034326  5  2.0
2013-01-04 -2.111128 -0.567974  1.319383  5  3.0
2013-01-05  0.245426  0.175320  0.138328  5  4.0
2013-01-06 -0.651215 -0.962571  1.324725  5  5.0

Sets entire column with NumPy array
* uses label method
* len(df) = 6 because 6 rows --> [5, 5, 5, 5, 5, 5] --> D = 5 for each of 6 rows

In [45]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.787771 -5  NaN
2013-01-02 -0.033047 -0.929481 -0.305967 -5 -1.0
2013-01-03 -0.224747 -0.999217 -0.034326 -5 -2.0
2013-01-04 -2.111128 -0.567974 -1.319383 -5 -3.0
2013-01-05 -0.245426 -0.175320 -0.138328 -5 -4.0
2013-01-06 -0.651215 -0.962571 -1.324725 -5 -5.0

Copies data and uses boolean indexing to set all non negative values to negative

# Missing Data

Pandas uses np.nan (NaN to represent missing data
* by default not included in operations (skips over so no error)

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1

df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.787771  5  NaN  1.0
2013-01-02  0.033047 -0.929481 -0.305967  5  1.0  1.0
2013-01-03  0.224747  0.999217  0.034326  5  2.0  NaN
2013-01-04 -2.111128 -0.567974  1.319383  5  3.0  NaN

Reindex can be used to change/add/delete index on axis (perminantly alters because creates new variable)
* slicing returns row slice without changing original data but reindex gets rid on unused rows
* Here we reindex to 0-3 or [0:4], E is added as a colum and set to 1 for row 1 & 2

In [47]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.033047 -0.929481 -0.305967  5  1.0  1.0

Drops rows with missing data

In [48]:
df1.fillna(value= 69) ## or
df1.fillna(value= 'A')

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -0.787771  5  A  1
2013-01-02  0.033047 -0.929481 -0.305967  5  1  1
2013-01-03  0.224747  0.999217  0.034326  5  2  A
2013-01-04 -2.111128 -0.567974  1.319383  5  3  A

Fills in missing data to some value

In [49]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

Gets boolean mask that is true where values are NaN

# Operations

Operations generally exclude missing data

## Stats

In [50]:
df.mean()

A   -0.376520
B   -0.214248
C    0.287171
D    5.000000
F    3.000000
dtype: float64

Returns mean of rows as series
* same for all descriptive statistics

In [51]:
df.mean(1)

2013-01-01    1.053057
2013-01-02    0.959520
2013-01-03    1.651658
2013-01-04    1.328056
2013-01-05    1.911815
2013-01-06    1.942188
Freq: D, dtype: float64

Returns mean of columns as series
* same for all descriptive statistics

In [52]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [53]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.775253 -0.000783 -0.965674  4.0  1.0
2013-01-04 -5.111128 -3.567974 -1.680617  2.0  0.0
2013-01-05 -4.754574 -4.824680 -4.861672  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Operating with objects that have different dimensionality and need alignment 
* automatically broadcasts along specified dimension



1. creates series s
2. shifts series by 2
3. fills in the new values of row 1 & 2 with NaN automatically
4. uses sub to align df by substracting s from each row
    * Value - NaN = NaN

## Apply

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.787771   5   NaN
2013-01-02  0.033047 -0.929481 -1.093738  10   1.0
2013-01-03  0.257794  0.069736 -1.059412  15   3.0
2013-01-04 -1.853334 -0.498238  0.259971  20   6.0
2013-01-05 -1.607908 -0.322917  0.398299  25  10.0
2013-01-06 -2.259122 -1.285488  1.723024  30  15.0

Applying a function to all data values
* Note: for a given column cumsum adds up values from each row up to and including the current row and stores it in current row.
    * i.e. data[0] = data[0], data[1] = data[0] + data[1], data[2] = data[0] + data[1] + data[2]

## Histogramming

In [55]:
s = pd.Series(np.random.randint(0, 7, size=10)) ## creates series for example 1
s

0    6
1    3
2    0
3    0
4    3
5    6
6    2
7    3
8    4
9    5
dtype: int32

In [56]:
s.value_counts() ## example 1

3    3
6    2
0    2
5    1
4    1
2    1
dtype: int64

In [57]:
df['D'].value_counts() ## example 2

5    6
Name: D, dtype: int64

Creates Histograms from series: example with df['D'] and s
* countes number of times each value occurs in a column
* only counts numbers

# Merge

## Concat

In [58]:
df3 = pd.DataFrame(np.random.randn(10, 4)) ## making a random dataframe
df3

          0         1         2         3
0 -0.344410 -0.069546  0.152251  0.985430
1 -1.665087 -1.382853 -1.177578 -1.597728
2  1.045136 -1.218984 -1.042814 -0.441173
3 -0.282495 -0.386955  0.494182  0.597399
4 -0.031826  1.695417  1.056024 -0.785783
5 -1.362784 -0.485176  0.647061  0.315451
6  0.672426  0.045040  0.681738 -0.948588
7 -1.268982  0.225719 -0.227284  0.508423
8  0.425423 -0.766153 -0.440722 -0.666707
9  0.272929  1.364834  0.882347 -1.910672

In [59]:
pieces = [df3[:3], df3[3:7], df3[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.344410 -0.069546  0.152251  0.985430
1 -1.665087 -1.382853 -1.177578 -1.597728
2  1.045136 -1.218984 -1.042814 -0.441173
3 -0.282495 -0.386955  0.494182  0.597399
4 -0.031826  1.695417  1.056024 -0.785783
5 -1.362784 -0.485176  0.647061  0.315451
6  0.672426  0.045040  0.681738 -0.948588
7 -1.268982  0.225719 -0.227284  0.508423
8  0.425423 -0.766153 -0.440722 -0.666707
9  0.272929  1.364834  0.882347 -1.910672